---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Entity Constructor
Entity Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Entity()()()() | The default-constructed Entity is invalid. |
|  | Entity(Guid) | Creates a new Entity corresponding to the Schema of the specified GUID. |
|  | Entity(Entity) | Constructs a new copy of the input ESEntity object. |
|  | Entity(Schema) | Creates a new Entity corresponding to the Schema. |

# See Also

Entity Class

Entity Members

Autodesk.Revit.DB.ExtensibleStorage Namespace